names = ("Александр", "Алексей", "Иван", "Сергей", "Михаил", "Василий", "Петр", "Евгений", "Владимир",
         "Вячеслав", "Борис", "Артем", "Константин", "Ольга", "Елена", "Анна", "Светлана", "Наталья",
         "Нина", "Алла", "Екатерина")

surnames = ("Курт", "Шпак", "Берг", "Бриг", "Петрович", "Башко", "Карась", "Ивашкевич", "Мишук", "Сидарук", "Алехно",
            "Кресс", "Григарович", "Пряник", "Сапожко", "Король", "Перст", "Кот", "Брыль", "Агейко", "Бруно", "Воробей")

title_blog = ("Живопись", "Наука", "Культура", "Кино", "Юмор", "Гороскоп", "Новости", "Реклама", "Светская жизнь",
               "Технологии", "Политика", "Бизнес", "Погода")

tags = ("новинка", "верность", "солнце", "мир", "победа", "легкость", "тепло", "красота",
        "лихость", "крепость", "хмель", "краски", "осенние мотивы", "смех", "бодрость", "успех",
        "золото", "яркость", "уверенность", "чудо", "ремесло", "дресс-код", "природа", "благодать",
        "кремень", "радость", "кофе", "лидер", "сумерки", "тишина")

text_fish = "Задача организации, в особенности же повышение уровня гражданского сознания представляет собой интересный эксперимент проверки существующих финансовых и административных условий. Не следует, однако, забывать о том, что новая модель организационной деятельности позволяет выполнить важнейшие задания по разработке направлений прогрессивного развития. Дорогие друзья, реализация намеченного плана развития обеспечивает широкому кругу специалистов участие в формировании системы обучения кадров, соответствующей насущным потребностям. Таким образом, консультация с профессионалами из IT позволяет выполнить важнейшие задания по разработке системы масштабного изменения ряда параметров. Равным образом социально-экономическое развитие играет важную роль в формировании модели развития! Значимость этих проблем настолько очевидна, что реализация намеченного плана развития играет важную роль в формировании дальнейших направлений развитая системы массового участия! Соображения высшего порядка, а также новая модель организационной деятельности обеспечивает актуальность системы обучения кадров,соответствующей насущным потребностям. Задача организации, в особенности же реализация намеченного плана развития требует определения и уточнения форм воздействия! Равным образом сложившаяся структура организации требует от нас анализа существующих финансовых и административных условий? Задача организации, в особенности же рамки и место обучения кадров способствует повышению актуальности всесторонне сбалансированных нововведений. Разнообразный и богатый опыт консультация с профессионалами из IT играет важную роль в формировании модели развития."

title_article = text_fish.split(" ")

